###### Groupby allows you to group togeather  rows based off of a column and perform an aggreate function on them.

In [4]:
import numpy as np
import pandas as pd
d = {
    "Company":["Google", "Google", "Microsoft", "Microsoft", "facebook", "facebook"],
    "Person": ["Chandan", "Rajeev", "Ranjan", "Raushan", "Keshav", "Rahul"],
    "Salary":[300000, 180000, 240000, 200000, 400000, 800000]
}
d

{'Company': ['Google',
  'Google',
  'Microsoft',
  'Microsoft',
  'facebook',
  'facebook'],
 'Person': ['Chandan', 'Rajeev', 'Ranjan', 'Raushan', 'Keshav', 'Rahul'],
 'Salary': [300000, 180000, 240000, 200000, 400000, 800000]}

In [5]:
df = pd.DataFrame(d)
df

     Company   Person  Salary
0     Google  Chandan  300000
1     Google   Rajeev  180000
2  Microsoft   Ranjan  240000
3  Microsoft  Raushan  200000
4   facebook   Keshav  400000
5   facebook    Rahul  800000

In [8]:
byComp = df.groupby("Company")
byComp

In [9]:
byComp.mean()

           Salary
Company
Google     240000
Microsoft  220000
facebook   600000

In [11]:
byComp.sum()

            Salary
Company
Google      480000
Microsoft   440000
facebook   1200000

In [14]:
byComp.sum().loc['Google']

Salary    480000
Name: Google, dtype: int64

In [12]:
byComp.std()

                  Salary
Company
Google      84852.813742
Microsoft   28284.271247
facebook   282842.712475

In [17]:
df.groupby("Company").max()

            Person  Salary
Company
Google      Rajeev  300000
Microsoft  Raushan  240000
facebook     Rahul  800000

In [19]:
df.groupby("Company").min()

            Person  Salary
Company
Google     Chandan  180000
Microsoft   Ranjan  200000
facebook    Keshav  400000

In [20]:
df.groupby("Company").count()

           Person  Salary
Company
Google          2       2
Microsoft       2       2
facebook        2       2

In [22]:
df.groupby("Company").describe()

          Salary                                                         \
           count      mean            std       min       25%       50%
Company
Google       2.0  240000.0   84852.813742  180000.0  210000.0  240000.0
Microsoft    2.0  220000.0   28284.271247  200000.0  210000.0  220000.0
facebook     2.0  600000.0  282842.712475  400000.0  500000.0  600000.0


                75%       max
Company
Google     270000.0  300000.0
Microsoft  230000.0  240000.0
facebook   700000.0  800000.0

In [23]:
df.groupby("Company").describe().transpose()

Company              Google      Microsoft       facebook
Salary count       2.000000       2.000000       2.000000
       mean   240000.000000  220000.000000  600000.000000
       std     84852.813742   28284.271247  282842.712475
       min    180000.000000  200000.000000  400000.000000
       25%    210000.000000  210000.000000  500000.000000
       50%    240000.000000  220000.000000  600000.000000
       75%    270000.000000  230000.000000  700000.000000
       max    300000.000000  240000.000000  800000.000000

In [24]:
df.groupby("Company").describe().transpose()["facebook"]

Salary  count         2.000000
        mean     600000.000000
        std      282842.712475
        min      400000.000000
        25%      500000.000000
        50%      600000.000000
        75%      700000.000000
        max      800000.000000
Name: facebook, dtype: float64